package day1206;

import java.util.Iterator;

/**
대입연산자
=
+=,-=,*=,/=,%=
<<=, >>=, >>>=
&=, |=, ^=

*/
class Operator7 {
	public static void main(String[] args) {
		int i=0;
		i=2;//순수대입
		i+=7;//i=i+7;
		i-=5;//i=i-5;
		i*=2;//i=i*2;
		i/=3;//i=i/3;
		i%=3;//i=i%3;
		//쉬프트 대입
		i<<=4;//i=<<4; 0000 0010<<4 0010 0000
		System.out.println("i="+i);
		i>>=2;//i=>>2; 0010 0000>>2 0000 1000
		i>>>=1;//i=i>>>1; //0000 1000 >>>1 0000 0100 
		//비트논리 대입
		i&=14;//i=i&14 0000 0100 & 0000 1110
		i|=28;//i=i|24 0000 0100 | 0001 1100 > 0001 1100
		i^=4;//i=i^4 0001 1100 ^ 0000 0100 = 0001 1000
		System.out.println("i="+i);
		

	   
	  
	}
}
